gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt112sl.h
/* SDA hold time */
typedef enum TWI_SDAHOLD_enum
{
    TWI_SDAHOLD_OFF_gc = (0x00<<1),  /* SDA hold time off */
    TWI_SDAHOLD_50NS_gc = (0x01<<1),  /* Typical 50ns hold time */
    TWI_SDAHOLD_300NS_gc = (0x02<<1),  /* Typical 300ns hold time */
    TWI_SDAHOLD_400NS_gc = (0x03<<1),  /* Typical 400ns hold time */
} TWI_SDAHOLD_t;

/*
--------------------------------------------------------------------------
WDT - Watch-Dog Timer
--------------------------------------------------------------------------
*/

/* Watch-Dog Timer */
typedef struct WDT_struct
{
    register8_t CTRL;  /* Control */
    register8_t WINCTRL;  /* Windowed Mode Control */
    register8_t STATUS;  /* Status */
} WDT_t;

/* Period setting */
typedef enum WDT_PER_enum
{
    WDT_PER_8CLK_gc = (0x00<<2),  /* 8 cycles (8ms @ 3.3V) */
    WDT_PER_16CLK_gc = (0x01<<2),  /* 16 cycles (16ms @ 3.3V) */
    WDT_PER_32CLK_gc = (0x02<<2),  /* 32 cycles (32ms @ 3.3V) */
    WDT_PER_64CLK_gc = (0x03<<2),  /* 64 cycles (64ms @ 3.3V) */
    WDT_PER_128CLK_gc = (0x04<<2),  /* 128 cycles (0.128s @ 3.3V) */
    WDT_PER_256CLK_gc = (0x05<<2),  /* 256 cycles (0.256s @ 3.3V) */
    WDT_PER_512CLK_gc = (0x06<<2),  /* 512 cycles (0.512s @ 3.3V) */
    WDT_PER_1KCLK_gc = (0x07<<2),  /* 1K cycles (1s @ 3.3V) */
    WDT_PER_2KCLK_gc = (0x08<<2),  /* 2K cycles (2s @ 3.3V) */
    WDT_PER_4KCLK_gc = (0x09<<2),  /* 4K cycles (4s @ 3.3V) */
    WDT_PER_8KCLK_gc = (0x0A<<2),  /* 8K cycles (8s @ 3.3V) */
} WDT_PER_t;

/* Closed window period */
typedef enum WDT_WPER_enum
{
    WDT_WPER_8CLK_gc = (0x00<<2),  /* 8 cycles (8ms @ 3.3V) */
    WDT_WPER_16CLK_gc = (0x01<<2),  /* 16 cycles (16ms @ 3.3V) */
    WDT_WPER_32CLK_gc = (0x02<<2),  /* 32 cycles (32ms @ 3.3V) */
    WDT_WPER_64CLK_gc = (0x03<<2),  /* 64 cycles (64ms @ 3.3V) */
    WDT_WPER_128CLK_gc = (0x04<<2),  /* 128 cycles (0.128s @ 3.3V) */
    WDT_WPER_256CLK_gc = (0x05<<2),  /* 256 cycles (0.256s @ 3.3V) */
    WDT_WPER_512CLK_gc = (0x06<<2),  /* 512 cycles (0.512s @ 3.3V) */
    WDT_WPER_1KCLK_gc = (0x07<<2),  /* 1K cycles (1s @ 3.3V) */
    WDT_WPER_2KCLK_gc = (0x08<<2),  /* 2K cycles (2s @ 3.3V) */
    WDT_WPER_4KCLK_gc = (0x09<<2),  /* 4K cycles (4s @ 3.3V) */
    WDT_WPER_8KCLK_gc = (0x0A<<2),  /* 8K cycles (8s @ 3.3V) */
} WDT_WPER_t;

/*
--------------------------------------------------------------------------
XOCD - On-Chip Debug System
--------------------------------------------------------------------------
*/

/* On-Chip Debug System */
typedef struct OCD_struct
{
    register8_t OCDR0;  /* OCD Register 0 */
    register8_t OCDR1;  /* OCD Register 1 */
} OCD_t;

/*
==========================================================================
IO Module Instances. Mapped to memory.
==========================================================================
*/

#define VPORT0              (*(VPORT_t *) 0x0010) /* Virtual Port */
#define VPORT1              (*(VPORT_t *) 0x0014) /* Virtual Port */
#define VPORT2              (*(VPORT_t *) 0x0018) /* Virtual Port */
#define VPORT3              (*(VPORT_t *) 0x001C) /* Virtual Port */
#define OCD                   (*(OCD_t *) 0x002E) /* On-Chip Debug System */
#define CLK                   (*(CLK_t *) 0x0040) /* Clock System */
#define SLEEP               (*(SLEEP_t *) 0x0048) /* Sleep Controller */
#define OSC                   (*(OSC_t *) 0x0050) /* Oscillator */
#define DFLLRC32M            (*(DFLL_t *) 0x0060) /* DFLL */
#define PR                     (*(PR_t *) 0x0070) /* Power Reduction */
#define RST                   (*(RST_t *) 0x0078) /* Reset */
#define WDT                   (*(WDT_t *) 0x0080) /* Watch-Dog Timer */
#define MCU                   (*(MCU_t *) 0x0090) /* MCU Control */
#define PMIC                 (*(PMIC_t *) 0x00A0) /* Programmable Multi-level Interrupt Controller */
#define PORTCFG           (*(PORTCFG_t *) 0x00B0) /* I/O port Configuration */
#define NVM                   (*(NVM_t *) 0x01C0) /* Non-volatile Memory Controller */
#define PWR                   (*(PWR_t *) 0x01F0) /* Power Control */
#define RTC                   (*(RTC_t *) 0x0400) /* Real-Time Counter */
#define TWIC                  (*(TWI_t *) 0x0480) /* Two-Wire Interface */
#define PORTC                (*(PORT_t *) 0x0640) /* I/O Ports */
#define PORTH              (*(PORT_T_t *) 0x06E0) /* I/O Ports, disableable */
#define PORTJ              (*(PORT_T_t *) 0x0700) /* I/O Ports, disableable */
#define PORTK              (*(PORT_T_t *) 0x0720) /* I/O Ports, disableable */
#define CTE                   (*(CTE_t *) 0x0C00) /* CTE Module */

#endif /* !defined (__ASSEMBLER__) */


/* ========== Flattened fully qualified IO register names ========== */


/* GPIO - General Purpose IO Registers */
#define GPIO_GPIOR  _SFR_MEM8(0x0000)


/* Deprecated */
#define GPIO_GPIO  _SFR_MEM8(0x0000)


/* NVM_FUSES (FUSE) - Fuses */
#define FUSE_FUSEBYTE4  _SFR_MEM8(0x0004)
#define FUSE_FUSEBYTE5  _SFR_MEM8(0x0005)


/* NVM_LOCKBITS (LOCKBIT) - Lock Bits */
#define LOCKBIT_LOCKBITS  _SFR_MEM8(0x0000)


/* NVM_PROD_SIGNATURES (PROD_SIGNATURES) - Production Signatures */
#define PRODSIGNATURES_RC24MCALB  _SFR_MEM8(0x0000)
#define PRODSIGNATURES_RC24MCALA  _SFR_MEM8(0x0001)
#define PRODSIGNATURES_FUSEBYTE1  _SFR_MEM8(0x0002)
#define PRODSIGNATURES_FUSE_EEH5  _SFR_MEM8(0x0003)
#define PRODSIGNATURES_RC32K  _SFR_MEM8(0x0004)
#define PRODSIGNATURES_FUSE_EEH6  _SFR_MEM8(0x0005)
#define PRODSIGNATURES_FUSEBYTE2  _SFR_MEM8(0x0006)
#define PRODSIGNATURES_FUSE_EEH4  _SFR_MEM8(0x0007)
#define PRODSIGNATURES_LOTNUM0  _SFR_MEM8(0x0008)
#define PRODSIGNATURES_LOTNUM1  _SFR_MEM8(0x0009)
#define PRODSIGNATURES_LOTNUM2  _SFR_MEM8(0x000A)
#define PRODSIGNATURES_LOTNUM3  _SFR_MEM8(0x000B)
#define PRODSIGNATURES_LOTNUM4  _SFR_MEM8(0x000C)
#define PRODSIGNATURES_LOTNUM5  _SFR_MEM8(0x000D)
#define PRODSIGNATURES_LOTNUM6  _SFR_MEM8(0x000E)
#define PRODSIGNATURES_LOTNUM7  _SFR_MEM8(0x000F)
#define PRODSIGNATURES_WAFNUM  _SFR_MEM8(0x0010)
#define PRODSIGNATURES_COORDX0  _SFR_MEM8(0x0012)
#define PRODSIGNATURES_COORDX1  _SFR_MEM8(0x0013)
#define PRODSIGNATURES_COORDY0  _SFR_MEM8(0x0014)
#define PRODSIGNATURES_COORDY1  _SFR_MEM8(0x0015)
#define PRODSIGNATURES_LOTNUM8  _SFR_MEM8(0x0016)
#define PRODSIGNATURES_LOTNUM9  _SFR_MEM8(0x0017)
#define PRODSIGNATURES_LOTNUM10  _SFR_MEM8(0x0018)
#define PRODSIGNATURES_LOTNUM11  _SFR_MEM8(0x0019)
#define PRODSIGNATURES_BGCAL0  _SFR_MEM8(0x0038)
#define PRODSIGNATURES_BGCAL1  _SFR_MEM8(0x0039)
#define PRODSIGNATURES_BGCAL2  _SFR_MEM8(0x003A)
#define PRODSIGNATURES_XLINE_BIAS_250_H  _SFR_MEM8(0x003C)
#define PRODSIGNATURES_XLINE_BIAS_250_L  _SFR_MEM8(0x003D)
#define PRODSIGNATURES_XLINE_BIAS_350_H  _SFR_MEM8(0x003E)
#define PRODSIGNATURES_XLINE_BIAS_350_L  _SFR_MEM8(0x003F)
#define PRODSIGNATURES_XLINE_BIAS_500_H  _SFR_MEM8(0x0040)
#define PRODSIGNATURES_XLINE_BIAS_500_L  _SFR_MEM8(0x0041)
#define PRODSIGNATURES_YLINE_INT_BIAS  _SFR_MEM8(0x0042)
#define PRODSIGNATURES_YLINEINT_CAP  _SFR_MEM8(0x0043)
#define PRODSIGNATURES_ADC10_CAL  _SFR_MEM8(0x0044)
#define PRODSIGNATURES_ADCSHVBCALH  _SFR_MEM8(0x0045)
#define PRODSIGNATURES_ADCSHVBCALL  _SFR_MEM8(0x0046)
#define PRODSIGNATURES_YLINE_INT_BIAS_150  _SFR_MEM8(0x0047)
#define PRODSIGNATURES_UID0_RANDOM_BYTE0  _SFR_MEM8(0x0050)
#define PRODSIGNATURES_UID0_RANDOM_BYTE1  _SFR_MEM8(0x0051)
#define PRODSIGNATURES_UID2_IP_HASH_BYTE0  _SFR_MEM8(0x0052)
#define PRODSIGNATURES_UID3_SITE  _SFR_MEM8(0x0053)
#define PRODSIGNATURES_UID3_UTC_Byte0  _SFR_MEM8(0x0054)
#define PRODSIGNATURES_UID4_UTC_Byte1  _SFR_MEM8(0x0055)
#define PRODSIGNATURES_UID5_UTC_Byte2  _SFR_MEM8(0x0056)
#define PRODSIGNATURES_UID6_UTC_Byte3  _SFR_MEM8(0x0057)
#define PRODSIGNATURES_BGEXTREME0_WS  _SFR_MEM8(0x00AC)
#define PRODSIGNATURES_BGEXTREME1_WS  _SFR_MEM8(0x00AD)
#define PRODSIGNATURES_BGEXTREME2_WS  _SFR_MEM8(0x00AE)
#define PRODSIGNATURES_BGEXTREME3_WS  _SFR_MEM8(0x00AF)
#define PRODSIGNATURES_CRCMASKL  _SFR_MEM8(0x00FE)
#define PRODSIGNATURES_CRCMASKH  _SFR_MEM8(0x00FF)


/* VPORT (VPORT0) - Virtual Port */
#define VPORT0_DIR  _SFR_MEM8(0x0010)
#define VPORT0_OUT  _SFR_MEM8(0x0011)
#define VPORT0_IN  _SFR_MEM8(0x0012)
#define VPORT0_INTFLAGS  _SFR_MEM8(0x0013)


