gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt112sl.h
/* VPORT (VPORT1) - Virtual Port */
#define VPORT1_DIR  _SFR_MEM8(0x0014)
#define VPORT1_OUT  _SFR_MEM8(0x0015)
#define VPORT1_IN  _SFR_MEM8(0x0016)
#define VPORT1_INTFLAGS  _SFR_MEM8(0x0017)


/* VPORT (VPORT2) - Virtual Port */
#define VPORT2_DIR  _SFR_MEM8(0x0018)
#define VPORT2_OUT  _SFR_MEM8(0x0019)
#define VPORT2_IN  _SFR_MEM8(0x001A)
#define VPORT2_INTFLAGS  _SFR_MEM8(0x001B)


/* VPORT (VPORT3) - Virtual Port */
#define VPORT3_DIR  _SFR_MEM8(0x001C)
#define VPORT3_OUT  _SFR_MEM8(0x001D)
#define VPORT3_IN  _SFR_MEM8(0x001E)
#define VPORT3_INTFLAGS  _SFR_MEM8(0x001F)


/* OCD - On-Chip Debug System */
#define OCD_OCDR0  _SFR_MEM8(0x002E)
#define OCD_OCDR1  _SFR_MEM8(0x002F)


/* CPU - CPU registers */
#define CPU_CCP  _SFR_MEM8(0x0034)
#define CPU_RAMPD  _SFR_MEM8(0x0038)
#define CPU_RAMPX  _SFR_MEM8(0x0039)
#define CPU_RAMPY  _SFR_MEM8(0x003A)
#define CPU_RAMPZ  _SFR_MEM8(0x003B)
#define CPU_EIND  _SFR_MEM8(0x003C)
#define CPU_SPL  _SFR_MEM8(0x003D)
#define CPU_SPH  _SFR_MEM8(0x003E)
#define CPU_SREG  _SFR_MEM8(0x003F)


/* CLK - Clock System */
#define CLK_CTRL  _SFR_MEM8(0x0040)
#define CLK_PSCTRL  _SFR_MEM8(0x0041)
#define CLK_LOCK  _SFR_MEM8(0x0042)
#define CLK_RTCCTRL  _SFR_MEM8(0x0043)


/* SLEEP - Sleep Controller */
#define SLEEP_CTRL  _SFR_MEM8(0x0048)


/* OSC - Oscillator */
#define OSC_CTRL  _SFR_MEM8(0x0050)
#define OSC_STATUS  _SFR_MEM8(0x0051)
#define OSC_CLOCKINCTRL  _SFR_MEM8(0x0052)
#define OSC_XOSCFAIL  _SFR_MEM8(0x0053)
#define OSC_RC32KCAL  _SFR_MEM8(0x0054)
#define OSC_PLLCTRL  _SFR_MEM8(0x0055)
#define OSC_DFLLCTRL  _SFR_MEM8(0x0056)


/* DFLL (DFLLRC32M) - DFLL */
#define DFLLRC32M_CTRL  _SFR_MEM8(0x0060)
#define DFLLRC32M_CALA  _SFR_MEM8(0x0062)
#define DFLLRC32M_CALB  _SFR_MEM8(0x0063)
#define DFLLRC32M_COMP0  _SFR_MEM8(0x0064)
#define DFLLRC32M_COMP1  _SFR_MEM8(0x0065)
#define DFLLRC32M_COMP2  _SFR_MEM8(0x0066)


/* PR - Power Reduction */
#define PR_PRGEN  _SFR_MEM8(0x0070)
#define PR_PRPA  _SFR_MEM8(0x0071)
#define PR_PRPB  _SFR_MEM8(0x0072)
#define PR_PRPC  _SFR_MEM8(0x0073)
#define PR_PRPD  _SFR_MEM8(0x0074)
#define PR_PRPE  _SFR_MEM8(0x0075)
#define PR_PRPF  _SFR_MEM8(0x0076)


/* RST - Reset */
#define RST_STATUS  _SFR_MEM8(0x0078)
#define RST_CTRL  _SFR_MEM8(0x0079)


/* WDT - Watch-Dog Timer */
#define WDT_CTRL  _SFR_MEM8(0x0080)
#define WDT_WINCTRL  _SFR_MEM8(0x0081)
#define WDT_STATUS  _SFR_MEM8(0x0082)


/* MCU - MCU Control */
#define MCU_DEVID0  _SFR_MEM8(0x0090)
#define MCU_DEVID1  _SFR_MEM8(0x0091)
#define MCU_DEVID2  _SFR_MEM8(0x0092)
#define MCU_REVID  _SFR_MEM8(0x0093)
#define MCU_JTAGUID  _SFR_MEM8(0x0094)
#define MCU_MCUCR  _SFR_MEM8(0x0096)
#define MCU_EVSYSLOCK  _SFR_MEM8(0x0098)
#define MCU_AWEXLOCK  _SFR_MEM8(0x0099)


/* PMIC - Programmable Multi-level Interrupt Controller */
#define PMIC_STATUS  _SFR_MEM8(0x00A0)
#define PMIC_INTPRI  _SFR_MEM8(0x00A1)
#define PMIC_CTRL  _SFR_MEM8(0x00A2)


/* PORTCFG (PORT_CFG) - I/O port Configuration */
#define PORTCFG_MPCMASK  _SFR_MEM8(0x00B0)
#define PORTCFG_VPCTRLA  _SFR_MEM8(0x00B2)
#define PORTCFG_VPCTRLB  _SFR_MEM8(0x00B3)
#define PORTCFG_CLKEVOUT  _SFR_MEM8(0x00B4)


/* NVM - Non-volatile Memory Controller */
#define NVM_ADDR0  _SFR_MEM8(0x01C0)
#define NVM_ADDR1  _SFR_MEM8(0x01C1)
#define NVM_ADDR2  _SFR_MEM8(0x01C2)
#define NVM_DATA0  _SFR_MEM8(0x01C4)
#define NVM_DATA1  _SFR_MEM8(0x01C5)
#define NVM_DATA2  _SFR_MEM8(0x01C6)
#define NVM_CMD  _SFR_MEM8(0x01CA)
#define NVM_CTRLA  _SFR_MEM8(0x01CB)
#define NVM_CTRLB  _SFR_MEM8(0x01CC)
#define NVM_INTCTRL  _SFR_MEM8(0x01CD)
#define NVM_STATUS  _SFR_MEM8(0x01CF)
#define NVM_LOCKBITS  _SFR_MEM8(0x01D0)


/* PWR - Power Control */
#define PWR_PWRCR  _SFR_MEM8(0x01F0)
#define PWR_PWRSR  _SFR_MEM8(0x01F1)


/* RTC - Real-Time Counter */
#define RTC_CTRL  _SFR_MEM8(0x0400)
#define RTC_STATUS  _SFR_MEM8(0x0401)
#define RTC_INTCTRL  _SFR_MEM8(0x0402)
#define RTC_INTFLAGS  _SFR_MEM8(0x0403)
#define RTC_TEMP  _SFR_MEM8(0x0404)
#define RTC_CNT  _SFR_MEM16(0x0408)
#define RTC_CNTL  _SFR_MEM8(0x0408)
#define RTC_CNTH  _SFR_MEM8(0x0409)
#define RTC_PER  _SFR_MEM16(0x040A)
#define RTC_PERL  _SFR_MEM8(0x040A)
#define RTC_PERH  _SFR_MEM8(0x040B)
#define RTC_COMP  _SFR_MEM16(0x040C)
#define RTC_COMPL  _SFR_MEM8(0x040C)
#define RTC_COMPH  _SFR_MEM8(0x040D)


/* TWI (TWIC) - Two-Wire Interface */
#define TWIC_CTRL  _SFR_MEM8(0x0480)
#define TWIC_MASTER_CTRLA  _SFR_MEM8(0x0481)
#define TWIC_MASTER_CTRLB  _SFR_MEM8(0x0482)
#define TWIC_MASTER_CTRLC  _SFR_MEM8(0x0483)
#define TWIC_MASTER_STATUS  _SFR_MEM8(0x0484)
#define TWIC_MASTER_BAUD  _SFR_MEM8(0x0485)
#define TWIC_MASTER_ADDR  _SFR_MEM8(0x0486)
#define TWIC_MASTER_DATA  _SFR_MEM8(0x0487)


#define TWIC_SLAVE_CTRLA  _SFR_MEM8(0x0488)
#define TWIC_SLAVE_CTRLB  _SFR_MEM8(0x0489)
#define TWIC_SLAVE_STATUS  _SFR_MEM8(0x048A)
#define TWIC_SLAVE_ADDR  _SFR_MEM8(0x048B)
#define TWIC_SLAVE_DATA  _SFR_MEM8(0x048C)
#define TWIC_SLAVE_ADDRMASK  _SFR_MEM8(0x048D)




/* PORT (PORTC) - I/O Ports */
#define PORTC_DIR  _SFR_MEM8(0x0640)
#define PORTC_DIRSET  _SFR_MEM8(0x0641)
#define PORTC_DIRCLR  _SFR_MEM8(0x0642)
#define PORTC_DIRTGL  _SFR_MEM8(0x0643)
#define PORTC_OUT  _SFR_MEM8(0x0644)
#define PORTC_OUTSET  _SFR_MEM8(0x0645)
#define PORTC_OUTCLR  _SFR_MEM8(0x0646)
#define PORTC_OUTTGL  _SFR_MEM8(0x0647)
#define PORTC_IN  _SFR_MEM8(0x0648)
#define PORTC_INTCTRL  _SFR_MEM8(0x0649)
#define PORTC_INT0MASK  _SFR_MEM8(0x064A)
#define PORTC_INT1MASK  _SFR_MEM8(0x064B)
#define PORTC_INTFLAGS  _SFR_MEM8(0x064C)
#define PORTC_PIN0CTRL  _SFR_MEM8(0x0650)
#define PORTC_PIN1CTRL  _SFR_MEM8(0x0651)
#define PORTC_PIN2CTRL  _SFR_MEM8(0x0652)
#define PORTC_PIN3CTRL  _SFR_MEM8(0x0653)
#define PORTC_PIN4CTRL  _SFR_MEM8(0x0654)
#define PORTC_PIN5CTRL  _SFR_MEM8(0x0655)
#define PORTC_PIN6CTRL  _SFR_MEM8(0x0656)
#define PORTC_PIN7CTRL  _SFR_MEM8(0x0657)


/* PORT_T (PORTH) - I/O Ports, disableable */
#define PORTH_DIR  _SFR_MEM8(0x06E0)
#define PORTH_DIRSET  _SFR_MEM8(0x06E1)
#define PORTH_DIRCLR  _SFR_MEM8(0x06E2)
#define PORTH_DIRTGL  _SFR_MEM8(0x06E3)
#define PORTH_OUT  _SFR_MEM8(0x06E4)
#define PORTH_OUTSET  _SFR_MEM8(0x06E5)
#define PORTH_OUTCLR  _SFR_MEM8(0x06E6)
#define PORTH_OUTTGL  _SFR_MEM8(0x06E7)
#define PORTH_IN  _SFR_MEM8(0x06E8)
#define PORTH_INTCTRL  _SFR_MEM8(0x06E9)
#define PORTH_INT0MASK  _SFR_MEM8(0x06EA)
#define PORTH_INT1MASK  _SFR_MEM8(0x06EB)
#define PORTH_INTFLAGS  _SFR_MEM8(0x06EC)
#define PORTH_IDISABLE  _SFR_MEM8(0x06ED)
#define PORTH_PULL_UP  _SFR_MEM8(0x06EE)
#define PORTH_PIN0DISABLE  _SFR_MEM8(0x06F0)
#define PORTH_PIN1DISABLE  _SFR_MEM8(0x06F1)
#define PORTH_PIN2DISABLE  _SFR_MEM8(0x06F2)
#define PORTH_PIN3DISABLE  _SFR_MEM8(0x06F3)
#define PORTH_PIN4DISABLE  _SFR_MEM8(0x06F4)
#define PORTH_PIN5DISABLE  _SFR_MEM8(0x06F5)
#define PORTH_PIN6DISABLE  _SFR_MEM8(0x06F6)
#define PORTH_PIN7DISABLE  _SFR_MEM8(0x06F7)


/* PORT_T (PORTJ) - I/O Ports, disableable */
#define PORTJ_DIR  _SFR_MEM8(0x0700)
#define PORTJ_DIRSET  _SFR_MEM8(0x0701)
#define PORTJ_DIRCLR  _SFR_MEM8(0x0702)
#define PORTJ_DIRTGL  _SFR_MEM8(0x0703)
#define PORTJ_OUT  _SFR_MEM8(0x0704)
#define PORTJ_OUTSET  _SFR_MEM8(0x0705)
#define PORTJ_OUTCLR  _SFR_MEM8(0x0706)
#define PORTJ_OUTTGL  _SFR_MEM8(0x0707)
#define PORTJ_IN  _SFR_MEM8(0x0708)
#define PORTJ_INTCTRL  _SFR_MEM8(0x0709)
#define PORTJ_INT0MASK  _SFR_MEM8(0x070A)
#define PORTJ_INT1MASK  _SFR_MEM8(0x070B)
#define PORTJ_INTFLAGS  _SFR_MEM8(0x070C)
#define PORTJ_IDISABLE  _SFR_MEM8(0x070D)
#define PORTJ_PULL_UP  _SFR_MEM8(0x070E)
#define PORTJ_PIN0DISABLE  _SFR_MEM8(0x0710)
#define PORTJ_PIN1DISABLE  _SFR_MEM8(0x0711)
#define PORTJ_PIN2DISABLE  _SFR_MEM8(0x0712)
#define PORTJ_PIN3DISABLE  _SFR_MEM8(0x0713)
#define PORTJ_PIN4DISABLE  _SFR_MEM8(0x0714)
#define PORTJ_PIN5DISABLE  _SFR_MEM8(0x0715)
#define PORTJ_PIN6DISABLE  _SFR_MEM8(0x0716)
#define PORTJ_PIN7DISABLE  _SFR_MEM8(0x0717)


/* PORT_T (PORTK) - I/O Ports, disableable */
#define PORTK_DIR  _SFR_MEM8(0x0720)
#define PORTK_DIRSET  _SFR_MEM8(0x0721)
#define PORTK_DIRCLR  _SFR_MEM8(0x0722)
#define PORTK_DIRTGL  _SFR_MEM8(0x0723)
#define PORTK_OUT  _SFR_MEM8(0x0724)
#define PORTK_OUTSET  _SFR_MEM8(0x0725)
#define PORTK_OUTCLR  _SFR_MEM8(0x0726)
#define PORTK_OUTTGL  _SFR_MEM8(0x0727)
#define PORTK_IN  _SFR_MEM8(0x0728)
#define PORTK_INTCTRL  _SFR_MEM8(0x0729)
#define PORTK_INT0MASK  _SFR_MEM8(0x072A)
#define PORTK_INT1MASK  _SFR_MEM8(0x072B)
#define PORTK_INTFLAGS  _SFR_MEM8(0x072C)
#define PORTK_IDISABLE  _SFR_MEM8(0x072D)
#define PORTK_PULL_UP  _SFR_MEM8(0x072E)
#define PORTK_PIN0DISABLE  _SFR_MEM8(0x0730)
#define PORTK_PIN1DISABLE  _SFR_MEM8(0x0731)
#define PORTK_PIN2DISABLE  _SFR_MEM8(0x0732)
#define PORTK_PIN3DISABLE  _SFR_MEM8(0x0733)
#define PORTK_PIN4DISABLE  _SFR_MEM8(0x0734)
#define PORTK_PIN5DISABLE  _SFR_MEM8(0x0735)
#define PORTK_PIN6DISABLE  _SFR_MEM8(0x0736)
#define PORTK_PIN7DISABLE  _SFR_MEM8(0x0737)


/* CTE - CTE Module */
#define CTE_ADCYCHR  _SFR_MEM8(0x0C00)
#define CTE_INTCRC  _SFR_MEM8(0x0C01)
#define CTE_ADCSRACLR  _SFR_MEM8(0x0C02)
#define CTE_ADCSRASET  _SFR_MEM8(0x0C03)
#define CTE_INTCRBCLR  _SFR_MEM8(0x0C04)
#define CTE_INTCRBSET  _SFR_MEM8(0x0C05)
#define CTE_INTCRECLR  _SFR_MEM8(0x0C06)
#define CTE_INTCRESET  _SFR_MEM8(0x0C07)
#define CTE_INTXCHR  _SFR_MEM8(0x0C08)
#define CTE_INTOEN  _SFR_MEM8(0x0C09)
#define CTE_TIMMOECMP  _SFR_MEM8(0x0C0A)
#define CTE_TIMAPER  _SFR_MEM8(0x0C0C)
#define CTE_TIMBPER  _SFR_MEM8(0x0C0D)
#define CTE_TIMCPER  _SFR_MEM8(0x0C0E)
#define CTE_TIMMOEPER  _SFR_MEM8(0x0C0F)
#define CTE_TIMRSTPER  _SFR_MEM8(0x0C10)
#define CTE_INTDONE  _SFR_MEM8(0x0C11)
#define CTE_INTTRIGA  _SFR_MEM8(0x0C12)
#define CTE_INTGAIN0  _SFR_MEM8(0x0C14)
#define CTE_INTGAIN1  _SFR_MEM8(0x0C15)
#define CTE_INTGAIN2  _SFR_MEM8(0x0C16)
#define CTE_INTGAIN3  _SFR_MEM8(0x0C17)
#define CTE_GCAFSRA  _SFR_MEM8(0x0C18)
#define CTE_GCAFHDLCNT  _SFR_MEM8(0x0C1A)
#define CTE_GCAFHDHCNT  _SFR_MEM8(0x0C1B)
#define CTE_GCAFMCEN  _SFR_MEM8(0x0C1E)
#define CTE_GCAFCCCLIM  _SFR_MEM8(0x0C1F)
#define CTE_PIFXPORTA  _SFR_MEM8(0x0C20)
#define CTE_PIFYPORT  _SFR_MEM8(0x0C22)
#define CTE_PIFXDDRA  _SFR_MEM8(0x0C23)
#define CTE_PIFYDDR  _SFR_MEM8(0x0C25)
#define CTE_PIFXPINA  _SFR_MEM8(0x0C26)
#define CTE_PIFYPIN  _SFR_MEM8(0x0C28)
#define CTE_PIFXTGLA  _SFR_MEM8(0x0C29)
#define CTE_PIFYTGL  _SFR_MEM8(0x0C2B)
#define CTE_ADCCRA  _SFR_MEM8(0x0C40)
#define CTE_ADCCRB  _SFR_MEM8(0x0C41)
#define CTE_ADCINTCAL  _SFR_MEM8(0x0C43)
#define CTE_ADCRES  _SFR_MEM8(0x0C44)
#define CTE_ADCINTTEST  _SFR_MEM8(0x0C45)
#define CTE_ADCSHVBCAL  _SFR_MEM8(0x0C46)
#define CTE_INTCRA  _SFR_MEM8(0x0C48)
#define CTE_INTCRD  _SFR_MEM8(0x0C49)
#define CTE_INTEN  _SFR_MEM8(0x0C4A)
#define CTE_INTMASKEN  _SFR_MEM8(0x0C4B)
#define CTE_SHEN  _SFR_MEM8(0x0C4C)
#define CTE_BIASCR  _SFR_MEM8(0x0C4D)
#define CTE_HDCRA  _SFR_MEM8(0x0C50)
#define CTE_HDEN  _SFR_MEM8(0x0C51)
#define CTE_HDLOW  _SFR_MEM8(0x0C52)
#define CTE_HDHIGH  _SFR_MEM8(0x0C53)
#define CTE_GCAFCRA  _SFR_MEM8(0x0C58)
#define CTE_GCAFCRB  _SFR_MEM8(0x0C59)
#define CTE_GCAFBASELIM  _SFR_MEM8(0x0C5B)
#define CTE_GCAFPCLL  _SFR_MEM8(0x0C5C)
#define CTE_GCAFPCUL  _SFR_MEM8(0x0C5D)
#define CTE_PIFXENA  _SFR_MEM8(0x0C60)
#define CTE_PIFYEN  _SFR_MEM8(0x0C62)
#define CTE_PIFXDDRA_SHADOW  _SFR_MEM8(0x0C63)
#define CTE_PIFXDDRB_SHADOW  _SFR_MEM8(0x0C64)
#define CTE_PIFYDDR_SHADOW  _SFR_MEM8(0x0C65)
#define CTE_PIFXSRLA  _SFR_MEM8(0x0C66)
#define CTE_PIFYSRL  _SFR_MEM8(0x0C68)
#define CTE_CTTEMP  _SFR_MEM8(0x0C80)
#define CTE_CTCRA  _SFR_MEM8(0x0C81)
#define CTE_MS0_MSCRA  _SFR_MEM8(0x0CA0)
#define CTE_MS0_MSCRB  _SFR_MEM8(0x0CA1)
#define CTE_MS0_MSPSEL  _SFR_MEM8(0x0CA3)
#define CTE_MS0_MSSRACLR  _SFR_MEM8(0x0CA4)
#define CTE_MS0_MSSRASET  _SFR_MEM8(0x0CA5)
#define CTE_MS0_MSSRB  _SFR_MEM8(0x0CA6)
#define CTE_MS0_MSSRC  _SFR_MEM8(0x0CA7)
#define CTE_MS0_MSSRD  _SFR_MEM8(0x0CA8)
#define CTE_MS0_MSCCR  _SFR_MEM8(0x0CAA)
#define CTE_MS0_MSLRR  _SFR_MEM16(0x0CAD)
#define CTE_MS0_MSPC  _SFR_MEM16(0x0CB0)
#define CTE_MS0_MSHIF  _SFR_MEM8(0x0CB2)
#define CTE_MS0_MSIR0  _SFR_MEM8(0x0CB4)
#define CTE_MS0_MSIR1  _SFR_MEM8(0x0CB5)
#define CTE_MS0_MSIR2  _SFR_MEM8(0x0CB6)
#define CTE_MS0_MSIR3  _SFR_MEM8(0x0CB7)
#define CTE_MS0_MSIRBUF  _SFR_MEM16(0x0CB8)
#define CTE_MS0_MSR0  _SFR_MEM16(0x0CBA)


#define CTE_MS1_MSCRA  _SFR_MEM8(0x0CC0)
#define CTE_MS1_MSCRB  _SFR_MEM8(0x0CC1)
#define CTE_MS1_MSPSEL  _SFR_MEM8(0x0CC3)
#define CTE_MS1_MSSRACLR  _SFR_MEM8(0x0CC4)
#define CTE_MS1_MSSRASET  _SFR_MEM8(0x0CC5)
#define CTE_MS1_MSSRB  _SFR_MEM8(0x0CC6)
#define CTE_MS1_MSSRC  _SFR_MEM8(0x0CC7)
#define CTE_MS1_MSSRD  _SFR_MEM8(0x0CC8)
#define CTE_MS1_MSCCR  _SFR_MEM8(0x0CCA)
#define CTE_MS1_MSLRR  _SFR_MEM16(0x0CCD)
#define CTE_MS1_MSPC  _SFR_MEM16(0x0CD0)
#define CTE_MS1_MSHIF  _SFR_MEM8(0x0CD2)
#define CTE_MS1_MSIR0  _SFR_MEM8(0x0CD4)
#define CTE_MS1_MSIR1  _SFR_MEM8(0x0CD5)
#define CTE_MS1_MSIR2  _SFR_MEM8(0x0CD6)
#define CTE_MS1_MSIR3  _SFR_MEM8(0x0CD7)
#define CTE_MS1_MSIRBUF  _SFR_MEM16(0x0CD8)
#define CTE_MS1_MSR0  _SFR_MEM16(0x0CDA)





/*================== Bitfield Definitions ================== */

/* CLK - Clock System */
/* CLK.CTRL  bit masks and bit positions */
#define CLK_SCLKSEL_gm  0x07  /* System Clock Selection group mask. */
#define CLK_SCLKSEL_gp  0  /* System Clock Selection group position. */
#define CLK_SCLKSEL0_bm  (1<<0)  /* System Clock Selection bit 0 mask. */
#define CLK_SCLKSEL0_bp  0  /* System Clock Selection bit 0 position. */
#define CLK_SCLKSEL1_bm  (1<<1)  /* System Clock Selection bit 1 mask. */
#define CLK_SCLKSEL1_bp  1  /* System Clock Selection bit 1 position. */
#define CLK_SCLKSEL2_bm  (1<<2)  /* System Clock Selection bit 2 mask. */
#define CLK_SCLKSEL2_bp  2  /* System Clock Selection bit 2 position. */

/* CLK.PSCTRL  bit masks and bit positions */
#define CLK_PSBCDIV_gm  0x03  /* Prescaler B and C Division factor group mask. */
#define CLK_PSBCDIV_gp  0  /* Prescaler B and C Division factor group position. */
#define CLK_PSBCDIV0_bm  (1<<0)  /* Prescaler B and C Division factor bit 0 mask. */
#define CLK_PSBCDIV0_bp  0  /* Prescaler B and C Division factor bit 0 position. */
#define CLK_PSBCDIV1_bm  (1<<1)  /* Prescaler B and C Division factor bit 1 mask. */
#define CLK_PSBCDIV1_bp  1  /* Prescaler B and C Division factor bit 1 position. */
#define CLK_PSADIV_gm  0x7C  /* Prescaler A Division Factor group mask. */
#define CLK_PSADIV_gp  2  /* Prescaler A Division Factor group position. */
#define CLK_PSADIV0_bm  (1<<2)  /* Prescaler A Division Factor bit 0 mask. */
#define CLK_PSADIV0_bp  2  /* Prescaler A Division Factor bit 0 position. */
#define CLK_PSADIV1_bm  (1<<3)  /* Prescaler A Division Factor bit 1 mask. */
#define CLK_PSADIV1_bp  3  /* Prescaler A Division Factor bit 1 position. */
#define CLK_PSADIV2_bm  (1<<4)  /* Prescaler A Division Factor bit 2 mask. */
#define CLK_PSADIV2_bp  4  /* Prescaler A Division Factor bit 2 position. */
#define CLK_PSADIV3_bm  (1<<5)  /* Prescaler A Division Factor bit 3 mask. */
#define CLK_PSADIV3_bp  5  /* Prescaler A Division Factor bit 3 position. */
#define CLK_PSADIV4_bm  (1<<6)  /* Prescaler A Division Factor bit 4 mask. */
#define CLK_PSADIV4_bp  6  /* Prescaler A Division Factor bit 4 position. */

/* CLK.LOCK  bit masks and bit positions */
#define CLK_LOCK_bm  0x01  /* Clock System Lock bit mask. */
#define CLK_LOCK_bp  0  /* Clock System Lock bit position. */

