gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt112sl.h
/* CTE.TIMMOECMP  bit masks and bit positions */
#define CTE_TIMMOECMP_7_0_gm  0xFF  /*  group mask. */
#define CTE_TIMMOECMP_7_0_gp  0  /*  group position. */
#define CTE_TIMMOECMP_7_00_bm  (1<<0)  /*  bit 0 mask. */
#define CTE_TIMMOECMP_7_00_bp  0  /*  bit 0 position. */
#define CTE_TIMMOECMP_7_01_bm  (1<<1)  /*  bit 1 mask. */
#define CTE_TIMMOECMP_7_01_bp  1  /*  bit 1 position. */
#define CTE_TIMMOECMP_7_02_bm  (1<<2)  /*  bit 2 mask. */
#define CTE_TIMMOECMP_7_02_bp  2  /*  bit 2 position. */
#define CTE_TIMMOECMP_7_03_bm  (1<<3)  /*  bit 3 mask. */
#define CTE_TIMMOECMP_7_03_bp  3  /*  bit 3 position. */
#define CTE_TIMMOECMP_7_04_bm  (1<<4)  /*  bit 4 mask. */
#define CTE_TIMMOECMP_7_04_bp  4  /*  bit 4 position. */
#define CTE_TIMMOECMP_7_05_bm  (1<<5)  /*  bit 5 mask. */
#define CTE_TIMMOECMP_7_05_bp  5  /*  bit 5 position. */
#define CTE_TIMMOECMP_7_06_bm  (1<<6)  /*  bit 6 mask. */
#define CTE_TIMMOECMP_7_06_bp  6  /*  bit 6 position. */
#define CTE_TIMMOECMP_7_07_bm  (1<<7)  /*  bit 7 mask. */
#define CTE_TIMMOECMP_7_07_bp  7  /*  bit 7 position. */

/* CTE.TIMAPER  bit masks and bit positions */
#define CTE_TIMAPER_7_0_gm  0xFF  /* Timer A Period bit 7-0 group mask. */
#define CTE_TIMAPER_7_0_gp  0  /* Timer A Period bit 7-0 group position. */
#define CTE_TIMAPER_7_00_bm  (1<<0)  /* Timer A Period bit 7-0 bit 0 mask. */
#define CTE_TIMAPER_7_00_bp  0  /* Timer A Period bit 7-0 bit 0 position. */
#define CTE_TIMAPER_7_01_bm  (1<<1)  /* Timer A Period bit 7-0 bit 1 mask. */
#define CTE_TIMAPER_7_01_bp  1  /* Timer A Period bit 7-0 bit 1 position. */
#define CTE_TIMAPER_7_02_bm  (1<<2)  /* Timer A Period bit 7-0 bit 2 mask. */
#define CTE_TIMAPER_7_02_bp  2  /* Timer A Period bit 7-0 bit 2 position. */
#define CTE_TIMAPER_7_03_bm  (1<<3)  /* Timer A Period bit 7-0 bit 3 mask. */
#define CTE_TIMAPER_7_03_bp  3  /* Timer A Period bit 7-0 bit 3 position. */
#define CTE_TIMAPER_7_04_bm  (1<<4)  /* Timer A Period bit 7-0 bit 4 mask. */
#define CTE_TIMAPER_7_04_bp  4  /* Timer A Period bit 7-0 bit 4 position. */
#define CTE_TIMAPER_7_05_bm  (1<<5)  /* Timer A Period bit 7-0 bit 5 mask. */
#define CTE_TIMAPER_7_05_bp  5  /* Timer A Period bit 7-0 bit 5 position. */
#define CTE_TIMAPER_7_06_bm  (1<<6)  /* Timer A Period bit 7-0 bit 6 mask. */
#define CTE_TIMAPER_7_06_bp  6  /* Timer A Period bit 7-0 bit 6 position. */
#define CTE_TIMAPER_7_07_bm  (1<<7)  /* Timer A Period bit 7-0 bit 7 mask. */
#define CTE_TIMAPER_7_07_bp  7  /* Timer A Period bit 7-0 bit 7 position. */

/* CTE.TIMBPER  bit masks and bit positions */
#define CTE_TIMBPER_7_0_gm  0xFF  /* Timer B Period bit 7-0 group mask. */
#define CTE_TIMBPER_7_0_gp  0  /* Timer B Period bit 7-0 group position. */
#define CTE_TIMBPER_7_00_bm  (1<<0)  /* Timer B Period bit 7-0 bit 0 mask. */
#define CTE_TIMBPER_7_00_bp  0  /* Timer B Period bit 7-0 bit 0 position. */
#define CTE_TIMBPER_7_01_bm  (1<<1)  /* Timer B Period bit 7-0 bit 1 mask. */
#define CTE_TIMBPER_7_01_bp  1  /* Timer B Period bit 7-0 bit 1 position. */
#define CTE_TIMBPER_7_02_bm  (1<<2)  /* Timer B Period bit 7-0 bit 2 mask. */
#define CTE_TIMBPER_7_02_bp  2  /* Timer B Period bit 7-0 bit 2 position. */
#define CTE_TIMBPER_7_03_bm  (1<<3)  /* Timer B Period bit 7-0 bit 3 mask. */
#define CTE_TIMBPER_7_03_bp  3  /* Timer B Period bit 7-0 bit 3 position. */
#define CTE_TIMBPER_7_04_bm  (1<<4)  /* Timer B Period bit 7-0 bit 4 mask. */
#define CTE_TIMBPER_7_04_bp  4  /* Timer B Period bit 7-0 bit 4 position. */
#define CTE_TIMBPER_7_05_bm  (1<<5)  /* Timer B Period bit 7-0 bit 5 mask. */
#define CTE_TIMBPER_7_05_bp  5  /* Timer B Period bit 7-0 bit 5 position. */
#define CTE_TIMBPER_7_06_bm  (1<<6)  /* Timer B Period bit 7-0 bit 6 mask. */
#define CTE_TIMBPER_7_06_bp  6  /* Timer B Period bit 7-0 bit 6 position. */
#define CTE_TIMBPER_7_07_bm  (1<<7)  /* Timer B Period bit 7-0 bit 7 mask. */
#define CTE_TIMBPER_7_07_bp  7  /* Timer B Period bit 7-0 bit 7 position. */

/* CTE.TIMCPER  bit masks and bit positions */
#define CTE_TIMCPER_7_0_gm  0xFF  /* Timer C Period bit 7-0 group mask. */
#define CTE_TIMCPER_7_0_gp  0  /* Timer C Period bit 7-0 group position. */
#define CTE_TIMCPER_7_00_bm  (1<<0)  /* Timer C Period bit 7-0 bit 0 mask. */
#define CTE_TIMCPER_7_00_bp  0  /* Timer C Period bit 7-0 bit 0 position. */
#define CTE_TIMCPER_7_01_bm  (1<<1)  /* Timer C Period bit 7-0 bit 1 mask. */
#define CTE_TIMCPER_7_01_bp  1  /* Timer C Period bit 7-0 bit 1 position. */
#define CTE_TIMCPER_7_02_bm  (1<<2)  /* Timer C Period bit 7-0 bit 2 mask. */
#define CTE_TIMCPER_7_02_bp  2  /* Timer C Period bit 7-0 bit 2 position. */
#define CTE_TIMCPER_7_03_bm  (1<<3)  /* Timer C Period bit 7-0 bit 3 mask. */
#define CTE_TIMCPER_7_03_bp  3  /* Timer C Period bit 7-0 bit 3 position. */
#define CTE_TIMCPER_7_04_bm  (1<<4)  /* Timer C Period bit 7-0 bit 4 mask. */
#define CTE_TIMCPER_7_04_bp  4  /* Timer C Period bit 7-0 bit 4 position. */
#define CTE_TIMCPER_7_05_bm  (1<<5)  /* Timer C Period bit 7-0 bit 5 mask. */
#define CTE_TIMCPER_7_05_bp  5  /* Timer C Period bit 7-0 bit 5 position. */
#define CTE_TIMCPER_7_06_bm  (1<<6)  /* Timer C Period bit 7-0 bit 6 mask. */
#define CTE_TIMCPER_7_06_bp  6  /* Timer C Period bit 7-0 bit 6 position. */
#define CTE_TIMCPER_7_07_bm  (1<<7)  /* Timer C Period bit 7-0 bit 7 mask. */
#define CTE_TIMCPER_7_07_bp  7  /* Timer C Period bit 7-0 bit 7 position. */

/* CTE.TIMMOEPER  bit masks and bit positions */
#define CTE_TIMMOEPER_7_0_gm  0xFF  /* Integrator Master Output Enable Timer Period bit 7-0 group mask. */
#define CTE_TIMMOEPER_7_0_gp  0  /* Integrator Master Output Enable Timer Period bit 7-0 group position. */
#define CTE_TIMMOEPER_7_00_bm  (1<<0)  /* Integrator Master Output Enable Timer Period bit 7-0 bit 0 mask. */
#define CTE_TIMMOEPER_7_00_bp  0  /* Integrator Master Output Enable Timer Period bit 7-0 bit 0 position. */
#define CTE_TIMMOEPER_7_01_bm  (1<<1)  /* Integrator Master Output Enable Timer Period bit 7-0 bit 1 mask. */
#define CTE_TIMMOEPER_7_01_bp  1  /* Integrator Master Output Enable Timer Period bit 7-0 bit 1 position. */
#define CTE_TIMMOEPER_7_02_bm  (1<<2)  /* Integrator Master Output Enable Timer Period bit 7-0 bit 2 mask. */
#define CTE_TIMMOEPER_7_02_bp  2  /* Integrator Master Output Enable Timer Period bit 7-0 bit 2 position. */
#define CTE_TIMMOEPER_7_03_bm  (1<<3)  /* Integrator Master Output Enable Timer Period bit 7-0 bit 3 mask. */
#define CTE_TIMMOEPER_7_03_bp  3  /* Integrator Master Output Enable Timer Period bit 7-0 bit 3 position. */
#define CTE_TIMMOEPER_7_04_bm  (1<<4)  /* Integrator Master Output Enable Timer Period bit 7-0 bit 4 mask. */
#define CTE_TIMMOEPER_7_04_bp  4  /* Integrator Master Output Enable Timer Period bit 7-0 bit 4 position. */
#define CTE_TIMMOEPER_7_05_bm  (1<<5)  /* Integrator Master Output Enable Timer Period bit 7-0 bit 5 mask. */
#define CTE_TIMMOEPER_7_05_bp  5  /* Integrator Master Output Enable Timer Period bit 7-0 bit 5 position. */
#define CTE_TIMMOEPER_7_06_bm  (1<<6)  /* Integrator Master Output Enable Timer Period bit 7-0 bit 6 mask. */
#define CTE_TIMMOEPER_7_06_bp  6  /* Integrator Master Output Enable Timer Period bit 7-0 bit 6 position. */
#define CTE_TIMMOEPER_7_07_bm  (1<<7)  /* Integrator Master Output Enable Timer Period bit 7-0 bit 7 mask. */
#define CTE_TIMMOEPER_7_07_bp  7  /* Integrator Master Output Enable Timer Period bit 7-0 bit 7 position. */

/* CTE.TIMRSTPER  bit masks and bit positions */
#define CTE_TIMRSTPER_7_0_gm  0xFF  /* Integrator Reset Timer Period bit 7-0 group mask. */
#define CTE_TIMRSTPER_7_0_gp  0  /* Integrator Reset Timer Period bit 7-0 group position. */
#define CTE_TIMRSTPER_7_00_bm  (1<<0)  /* Integrator Reset Timer Period bit 7-0 bit 0 mask. */
#define CTE_TIMRSTPER_7_00_bp  0  /* Integrator Reset Timer Period bit 7-0 bit 0 position. */
#define CTE_TIMRSTPER_7_01_bm  (1<<1)  /* Integrator Reset Timer Period bit 7-0 bit 1 mask. */
#define CTE_TIMRSTPER_7_01_bp  1  /* Integrator Reset Timer Period bit 7-0 bit 1 position. */
#define CTE_TIMRSTPER_7_02_bm  (1<<2)  /* Integrator Reset Timer Period bit 7-0 bit 2 mask. */
#define CTE_TIMRSTPER_7_02_bp  2  /* Integrator Reset Timer Period bit 7-0 bit 2 position. */
#define CTE_TIMRSTPER_7_03_bm  (1<<3)  /* Integrator Reset Timer Period bit 7-0 bit 3 mask. */
#define CTE_TIMRSTPER_7_03_bp  3  /* Integrator Reset Timer Period bit 7-0 bit 3 position. */
#define CTE_TIMRSTPER_7_04_bm  (1<<4)  /* Integrator Reset Timer Period bit 7-0 bit 4 mask. */
#define CTE_TIMRSTPER_7_04_bp  4  /* Integrator Reset Timer Period bit 7-0 bit 4 position. */
#define CTE_TIMRSTPER_7_05_bm  (1<<5)  /* Integrator Reset Timer Period bit 7-0 bit 5 mask. */
#define CTE_TIMRSTPER_7_05_bp  5  /* Integrator Reset Timer Period bit 7-0 bit 5 position. */
#define CTE_TIMRSTPER_7_06_bm  (1<<6)  /* Integrator Reset Timer Period bit 7-0 bit 6 mask. */
#define CTE_TIMRSTPER_7_06_bp  6  /* Integrator Reset Timer Period bit 7-0 bit 6 position. */
#define CTE_TIMRSTPER_7_07_bm  (1<<7)  /* Integrator Reset Timer Period bit 7-0 bit 7 mask. */
#define CTE_TIMRSTPER_7_07_bp  7  /* Integrator Reset Timer Period bit 7-0 bit 7 position. */

